## К сожалению только заглушка. Был в командировке. Надеюсь нагнать...

In [67]:
import numpy as np
import pandas as pd

from typing import List, Optional

In [8]:
!dir geekbrains-competitive-data-analysis

 ’®¬ ў гбва®©бвўҐ C ­Ґ Ё¬ҐҐв ¬ҐвЄЁ.
 ‘ҐаЁ©­л© ­®¬Ґа в®¬ : 3E53-B9F9

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\YandexDisk\Jupyter\Kaggle\SportAn\HW_03\geekbrains-competitive-data-analysis

22.09.2020  10:54    <DIR>          .
22.09.2020  10:54    <DIR>          ..
22.09.2020  10:54       267я188я369 applications_history.csv
22.09.2020  10:52        97я196я537 bki.csv
22.09.2020  10:52        43я291я777 client_profile.csv
22.09.2020  10:52        56я468я161 payments.csv
22.09.2020  10:50         1я981я718 sample_submit.csv
22.09.2020  10:50         2я587я116 test.csv
22.09.2020  10:50         1я945я420 train.csv
               7 д ©«®ў    470я659я098 Ў ©в
               2 Ї Ї®Є  25я414я279я168 Ў ©в бў®Ў®¤­®

In [15]:
data_dir = "geekbrains-competitive-data-analysis" + '\\'

In [31]:
src_list = ["train", "applications_history", "bki", "client_profile", "payments"]

In [32]:
source = {}
for name in src_list:
    source[name] = pd.read_csv(data_dir + name + ".csv")

In [58]:
# test = pd.read_csv(data_dir + "test" + ".csv")
# test.head(3)

In [57]:
# sample_submit = pd.read_csv(data_dir + "sample_submit" + ".csv")
# sample_submit.head(3)

In [45]:
for name in src_list:
    print(f"{name} \n {source[name].shape} \n")

train
 (110093, 3)

applications_history
 (1670214, 26)

bki
 (945234, 17)

client_profile
 (250000, 24)

payments
 (1023932, 8)

In [59]:
pd.set_option('display.max_columns', 100)

In [60]:
source['train'].head(3)

   APPLICATION_NUMBER  TARGET NAME_CONTRACT_TYPE
0           123687442       0               Cash
1           123597908       1               Cash
2           123526683       0               Cash

In [61]:
source['client_profile'].head(3)

,APPLICATION_NUMBER,GENDER,CHILDRENS,TOTAL_SALARY,AMOUNT_CREDIT,AMOUNT_ANNUITY,EDUCATION_LEVEL,FAMILY_STATUS,REGION_POPULATION,AGE,DAYS_ON_LAST_JOB,OWN_CAR_AGE,FLAG_PHONE,FLAG_EMAIL,FAMILY_SIZE,EXTERNAL_SCORING_RATING_1,EXTERNAL_SCORING_RATING_2,EXTERNAL_SCORING_RATING_3,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,123666076,F,0,157500.0,270000.0,13500.0,Incomplete higher,Civil marriage,0.008068,8560,1549,NaN,1,0,2.0,0.329471,0.236315,0.678568,0.0,0.0,0.0,0.0,1.0,2.0
1,123423688,F,0,270000.0,536917.5,28467.0,Secondary / secondary special,Married,0.020246,23187,365243,NaN,0,0,2.0,NaN,0.442295,0.802745,0.0,0.0,0.0,0.0,1.0,1.0
2,123501780,M,1,427500.0,239850.0,23850.0,Incomplete higher,Married,0.072508,14387,326,18.0,0,0,3.0,0.409017,0.738159,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [62]:
source['applications_history'].head(3)

,PREV_APPLICATION_NUMBER,APPLICATION_NUMBER,NAME_CONTRACT_TYPE,AMOUNT_ANNUITY,AMT_APPLICATION,AMOUNT_CREDIT,AMOUNT_PAYMENT,AMOUNT_GOODS_PAYMENT,NAME_CONTRACT_STATUS,DAYS_DECISION,NAME_PAYMENT_TYPE,CODE_REJECT_REASON,NAME_TYPE_SUITE,NAME_CLIENT_TYPE,NAME_GOODS_CATEGORY,NAME_PORTFOLIO,NAME_PRODUCT_TYPE,SELLERPLACE_AREA,CNT_PAYMENT,NAME_YIELD_GROUP,DAYS_FIRST_DRAWING,DAYS_FIRST_DUE,DAYS_LAST_DUE_1ST_VERSION,DAYS_LAST_DUE,DAYS_TERMINATION,NFLAG_INSURED_ON_APPROVAL
0,49298709,123595216,NaN,1730.430,17145.0,17145.0,0.0,17145.0,Approved,73,Cash through the bank,XAP,NaN,Repeater,Mobile,POS,XNA,35,12.0,middle,365243.0,42.0,300.0,42.0,37.0,0.0
1,50070639,123431468,Cash,25188.615,607500.0,679671.0,NaN,607500.0,Approved,164,XNA,XAP,Unaccompanied,Repeater,XNA,Cash,x-sell,-1,36.0,low_action,365243.0,134.0,916.0,365243.0,365243.0,1.0
2,49791680,123445379,Cash,15060.735,112500.0,136444.5,NaN,112500.0,Approved,301,Cash through the bank,XAP,"Spouse, partner",Repeater,XNA,Cash,x-sell,-1,12.0,high,365243.0,271.0,59.0,365243.0,365243.0,1.0

In [63]:
source['bki'].head(3)

,APPLICATION_NUMBER,BUREAU_ID,CREDIT_ACTIVE,CREDIT_CURRENCY,DAYS_CREDIT,CREDIT_DAY_OVERDUE,DAYS_CREDIT_ENDDATE,DAYS_ENDDATE_FACT,AMT_CREDIT_MAX_OVERDUE,CNT_CREDIT_PROLONG,AMT_CREDIT_SUM,AMT_CREDIT_SUM_DEBT,AMT_CREDIT_SUM_LIMIT,AMT_CREDIT_SUM_OVERDUE,CREDIT_TYPE,DAYS_CREDIT_UPDATE,AMT_ANNUITY
0,123538884,5223613,Active,currency 1,718.0,0,377.0,NaN,19386.81,0,675000.00,320265.495,0.0,0.0,Consumer credit,39.0,NaN
1,123436670,6207544,Closed,currency 1,696.0,0,511.0,511.0,0.00,0,93111.66,0.000,0.0,0.0,Consumer credit,505.0,NaN
2,123589020,6326395,Closed,currency 1,165.0,0,149.0,160.0,NaN,0,36000.00,0.000,0.0,0.0,Consumer credit,150.0,0.0

In [64]:
source['payments'].head(3)

,PREV_APPLICATION_NUMBER,APPLICATION_NUMBER,NUM_INSTALMENT_VERSION,NUM_INSTALMENT_NUMBER,DAYS_INSTALMENT,DAYS_ENTRY_PAYMENT,AMT_INSTALMENT,AMT_PAYMENT
0,49011181,123664960,1.0,5,1002.0,1015.0,12156.615,12156.615
1,48683432,123497205,1.0,13,442.0,432.0,18392.535,10047.645
2,48652024,123749925,1.0,10,8.0,23.0,5499.945,5499.945

In [53]:
for name in src_list:
    print(f"{name} \n")
    source[name].info()
    print("\n")

train

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110093 entries, 0 to 110092
Data columns (total 3 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   APPLICATION_NUMBER  110093 non-null  int64
 1   TARGET              110093 non-null  int64
 2   NAME_CONTRACT_TYPE  110093 non-null  object
dtypes: int64(2), object(1)
memory usage: 2.5+ MB


applications_history

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1670214 entries, 0 to 1670213
Data columns (total 26 columns):
 #   Column                     Non-Null Count    Dtype
---  ------                     --------------    -----
 0   PREV_APPLICATION_NUMBER    1670214 non-null  int64
 1   APPLICATION_NUMBER         1670214 non-null  int64
 2   NAME_CONTRACT_TYPE         940717 non-null   object
 3   AMOUNT_ANNUITY             1297979 non-null  float64
 4   AMT_APPLICATION            1670214 non-null  float64
 5   AMOUNT_CREDIT              1670213 non-null  float64
 6   AMOUNT_PAYMENT             774370 non-null   float64
 7   AMOUNT_GOODS_PAYMENT       1284699 non-null  float64
 8   NAME_CONTRACT_STATUS       1670214 non-null  object
 9   DAYS_DECISION              1670214 non-null  int64
 10  NAME_PAYMENT_TYPE          1670214 non-null  object
 11  CODE_REJECT_REASON         1670214 non-null  object
 12  NAME_TYPE_SUITE            849809 non-null   object
 13  NAME_CLIENT_TYPE           1670214 non-null  object
 14  NAME_GOODS_CATEGORY        1670214 non-null  object
 15  NAME_PORTFOLIO             1670214 non-null  object
 16  NAME_PRODUCT_TYPE          1670214 non-null  object
 17  SELLERPLACE_AREA           1670214 non-null  int64
 18  CNT_PAYMENT                1297984 non-null  float64
 19  NAME_YIELD_GROUP           1670214 non-null  object
 20  DAYS_FIRST_DRAWING         997149 non-null   float64
 21  DAYS_FIRST_DUE             997149 non-null   float64
 22  DAYS_LAST_DUE_1ST_VERSION  997149 non-null   float64
 23  DAYS_LAST_DUE              997149 non-null   float64
 24  DAYS_TERMINATION           997149 non-null   float64
 25  NFLAG_INSURED_ON_APPROVAL  997149 non-null   float64
dtypes: float64(12), int64(4), object(10)
memory usage: 331.3+ MB


bki

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 945234 entries, 0 to 945233
Data columns (total 17 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   APPLICATION_NUMBER      945234 non-null  int64
 1   BUREAU_ID               945234 non-null  int64
 2   CREDIT_ACTIVE           945234 non-null  object
 3   CREDIT_CURRENCY         945234 non-null  object
 4   DAYS_CREDIT             945234 non-null  float64
 5   CREDIT_DAY_OVERDUE      945234 non-null  int64
 6   DAYS_CREDIT_ENDDATE     886797 non-null  float64
 7   DAYS_ENDDATE_FACT       596274 non-null  float64
 8   AMT_CREDIT_MAX_OVERDUE  326557 non-null  float64
 9   CNT_CREDIT_PROLONG      945234 non-null  int64
 10  AMT_CREDIT_SUM          945229 non-null  float64
 11  AMT_CREDIT_SUM_DEBT     803483 non-null  float64
 12  AMT_CREDIT_SUM_LIMIT    619267 non-null  float64
 13  AMT_CREDIT_SUM_OVERDUE  945234 non-null  float64
 14  CREDIT_TYPE             945234 non-null  object
 15  DAYS_CREDIT_UPDATE      945234 non-null  float64
 16  AMT_ANNUITY             269330 non-null  float64
dtypes: float64(10), int64(4), object(3)
memory usage: 122.6+ MB


client_profile

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250000 entries, 0 to 249999
Data columns (total 24 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   APPLICATION_NUMBER          250000 non-null  int64
 1   GENDER                      250000 non-null  object
 2   CHILDRENS                   250000 non-null  int64
 3   TOTAL_SALARY                250000 non-null  float64
 4   AMOUNT_CREDIT               250000 non-null  float64
 5   AMOUNT_ANNUITY              249989 non-null  float64
 6   EDUCATION_LEVEL             250000 non-null  object
 7   FAMILY_STATUS               250000 non-null  object
 8   REGION_POPULATION           250000 non-null  float64
 9   AGE                         250000 non-null  int64
 10  DAYS_ON_LAST_JOB            250000 non-null  int64
 11  OWN_CAR_AGE                 85041 non-null   float64
 12  FLAG_PHONE                  250000 non-null  int64
 13  FLAG_EMAIL                  250000 non-null  int64
 14  FAMILY_SIZE                 249998 non-null  float64
 15  EXTERNAL_SCORING_RATING_1   109121 non-null  float64
 16  EXTERNAL_SCORING_RATING_2   249468 non-null  float64
 17  EXTERNAL_SCORING_RATING_3   200462 non-null  float64
 18  AMT_REQ_CREDIT_BUREAU_HOUR  216293 non-null  float64
 19  AMT_REQ_CREDIT_BUREAU_DAY   216293 non-null  float64
 20  AMT_REQ_CREDIT_BUREAU_WEEK  216293 non-null  float64
 21  AMT_REQ_CREDIT_BUREAU_MON   216293 non-null  float64
 22  AMT_REQ_CREDIT_BUREAU_QRT   216293 non-null  float64
 23  AMT_REQ_CREDIT_BUREAU_YEAR  216293 non-null  float64
dtypes: float64(15), int64(6), object(3)
memory usage: 45.8+ MB


payments

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1023932 entries, 0 to 1023931
Data columns (total 8 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   PREV_APPLICATION_NUMBER  1023932 non-null  int64
 1   APPLICATION_NUMBER       1023932 non-null  int64
 2   NUM_INSTALMENT_VERSION   1023932 non-null  float64
 3   NUM_INSTALMENT_NUMBER    1023932 non-null  int64
 4   DAYS_INSTALMENT          1023932 non-null  float64
 5   DAYS_ENTRY_PAYMENT       1023729 non-null  float64
 6   AMT_INSTALMENT           1023932 non-null  float64
 7   AMT_PAYMENT              1023729 non-null  float64
dtypes: float64(5), int64(3)
memory usage: 62.5 MB

In [75]:
def data_obj_discribe(data: pd.DataFrame):
# если столбец имеет тип 'object' и содержит менее 20 уникальных 
# распечатывает значения столбцов и подсчитывает количество значений

    # data: pd.DataFrame исходный датафрейм
    
    obj_fit = data.select_dtypes(include='object')
    print('*' * 100)
    for cat_colname in obj_fit.columns:
        if len(obj_fit[cat_colname].unique()) < 20:
            print(str(cat_colname) + '\n\n' + str(obj_fit[cat_colname].unique()) + '\n\n')
            print(obj_fit.groupby(cat_colname)[cat_colname].count())
            print('*' * 100 + '\n')

In [79]:
for name in src_list:
    obj_col = source[name].select_dtypes(include='object')
    if not obj_col.empty:
        print(f"\t{name}{source[name].shape}\n")
        data_obj_discribe(source[name])

	train(110093, 3)

****************************************************************************************************
NAME_CONTRACT_TYPE

['Cash' 'Credit Card']


NAME_CONTRACT_TYPE
Cash           99551
Credit Card    10542
Name: NAME_CONTRACT_TYPE, dtype: int64
****************************************************************************************************

	applications_history(1670214, 26)

****************************************************************************************************
NAME_CONTRACT_TYPE

[nan 'Cash' 'Credit Card']


NAME_CONTRACT_TYPE
Cash           747553
Credit Card    193164
Name: NAME_CONTRACT_TYPE, dtype: int64
****************************************************************************************************

NAME_CONTRACT_STATUS

['Approved' 'Refused' 'Canceled' 'Unused offer']


NAME_CONTRACT_STATUS
Approved        1036781
Canceled         316319
Refused          290678
Unused offer      26436
Name: NAME_CONTRACT_STATUS, dtype: int64
****************************************************************************************************

NAME_PAYMENT_TYPE

['Cash through the bank' 'XNA' 'Non-cash from your account'
 'Cashless from the account of the employer']


NAME_PAYMENT_TYPE
Cash through the bank                        1033552
Cashless from the account of the employer       1085
Non-cash from your account                      8193
XNA                                           627384
Name: NAME_PAYMENT_TYPE, dtype: int64
****************************************************************************************************

CODE_REJECT_REASON

['XAP' 'HC' 'LIMIT' 'CLIENT' 'SCOFR' 'SCO' 'XNA' 'VERIF' 'SYSTEM']


CODE_REJECT_REASON
CLIENT      26436
HC         175231
LIMIT       55680
SCO         37467
SCOFR       12811
SYSTEM        717
VERIF        3535
XAP       1353093
XNA          5244
Name: CODE_REJECT_REASON, dtype: int64
****************************************************************************************************

NAME_TYPE_SUITE

[nan 'Unaccompanied' 'Spouse, partner' 'Family' 'Children' 'Other_B'
 'Other_A' 'Group of people']


NAME_TYPE_SUITE
Children            31566
Family             213263
Group of people      2240
Other_A              9077
Other_B             17624
Spouse, partner     67069
Unaccompanied      508970
Name: NAME_TYPE_SUITE, dtype: int64
****************************************************************************************************

NAME_CLIENT_TYPE

['Repeater' 'New' 'Refreshed' 'XNA']


NAME_CLIENT_TYPE
New           301363
Refreshed     135649
Repeater     1231261
XNA             1941
Name: NAME_CLIENT_TYPE, dtype: int64
****************************************************************************************************

NAME_PORTFOLIO

['POS' 'Cash' 'XNA' 'Cards' 'Cars']


NAME_PORTFOLIO
Cards    144985
Cars        425
Cash     461563
POS      691011
XNA      372230
Name: NAME_PORTFOLIO, dtype: int64
****************************************************************************************************

NAME_PRODUCT_TYPE

['XNA' 'x-sell' 'walk-in']


NAME_PRODUCT_TYPE
XNA        1063666
walk-in     150261
x-sell      456287
Name: NAME_PRODUCT_TYPE, dtype: int64
****************************************************************************************************

NAME_YIELD_GROUP

['middle' 'low_action' 'high' 'low_normal' 'XNA']


NAME_YIELD_GROUP
XNA           517215
high          353331
low_action     92041
low_normal    322095
middle        385532
Name: NAME_YIELD_GROUP, dtype: int64
****************************************************************************************************

	bki(945234, 17)

****************************************************************************************************
CREDIT_ACTIVE

['Active' 'Closed' 'Sold' 'Bad debt']


CREDIT_ACTIVE
Active      347323
Bad debt        13
Closed      594315
Sold          3583
Name: CREDIT_ACTIVE, dtype: int64
****************************************************************************************************

CREDIT_CURRENCY

['currency 1' 'currency 2' 'currency 3' 'currency 4']


CREDIT_CURRENCY
currency 1    944492
currency 2       647
currency 3        91
currency 4         4
Name: CREDIT_CURRENCY, dtype: int64
****************************************************************************************************

CREDIT_TYPE

['Consumer credit' 'Credit card' 'Car loan' 'Mortgage'
 'Loan for business development' 'Microloan'
 'Loan for working capital replenishment' 'Unknown type of loan'
 'Loan for the purchase of equipment' 'Another type of loan'
 'Cash loan (non-earmarked)' 'Real estate loan' 'Mobile operator loan'
 'Loan for purchase of shares (margin lending)']


CREDIT_TYPE
Another type of loan                               586
Car loan                                         15348
Cash loan (non-earmarked)                           31
Consumer credit                                 688431
Credit card                                     222238
Loan for business development                     1055
Loan for purchase of shares (margin lending)         4
Loan for the purchase of equipment                  14
Loan for working capital replenishment             261
Microloan                                         6788
Mobile operator loan                                 1
Mortgage                                         10161
Real estate loan                                    16
Unknown type of loan                               300
Name: CREDIT_TYPE, dtype: int64
****************************************************************************************************

	client_profile(250000, 24)

****************************************************************************************************
GENDER

['F' 'M' 'XNA']


GENDER
F      164645
M       85351
XNA         4
Name: GENDER, dtype: int64
****************************************************************************************************

EDUCATION_LEVEL

['Incomplete higher' 'Secondary / secondary special' 'Lower secondary'
 'Higher education' 'Academic degree']


EDUCATION_LEVEL
Academic degree                     136
Higher education                  60864
Incomplete higher                  8357
Lower secondary                    3081
Secondary / secondary special    177562
Name: EDUCATION_LEVEL, dtype: int64
****************************************************************************************************

FAMILY_STATUS

['Civil marriage' 'Married' 'Widow' 'Single / not married' 'Separated'
 'Unknown']


FAMILY_STATUS
Civil marriage           24252
Married                 159846
Separated                15984
Single / not married     36883
Unknown                      2
Widow                    13033
Name: FAMILY_STATUS, dtype: int64
****************************************************************************************************

# ДЗ №3

## Задание №0

Выбрать любую модель машнного обучения и зафиксировать любой тип валидации. Обучить базовую модель и зафиксировать базовое качество модели. В каждом следующем задании нужно будет обучить выбранную модель и оценивать ее качество на зафиксированной схеме валидации. После каждого задания, требуется сделать вывод о достигаемом качестве модели, по сравнению с качестом из предыдущего шага.

## Задание №1

Признак TransactionDT - это смещение в секундах относительно базовой даты. Базовая дата - 2017-12-01, преобразовать признак TransactionDT в datetime, прибавив к базовой дате исходное значение признака. Из полученного признака выделить год, месяц, день недели, час, день.

## Задание №2

Сгруппировать данные по card1 и посчитать среднюю сумму транзакции. Добавить в качестве признака в набор данных. Посчитать разницу между суммой транзакцией пользователя и средней суммой транзакции по данному типу card1. Построить отношение этих признаков. Повторить процедуру для всех card.

## Задание №3

Преобразовать признаки card_1 - card_6 с помощью Frequency Encoding;

## Задание №4

Преобразовать признак TransactionAmt в логариф признака, выделить дробную часть и целую часть в отдельные признаки.

## Задание №5

Для числовых признаков построить PCA-признаки, добавить их к основной части датасета.

## Задание №6

Использовать критерий отбора признаков на основе перестановок для отбора признаков, которые положительно влияют на перформанс модели. Переобучить модель и сделать выводы о полученном качестве алгоритма.

## Задание №7

Испольовать SHAP для оценки важности признаков. Использовать SHAP для отбора признаков, проанализировать поведение модели на одном (любом) примере, посмотреть какой вклад каждый признак вносит в итоговый прогно. Проанализировать резульаты.